TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/aes_cbc_256_enc_dec/aes_cbc_256_enc_dec.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const AES    = scripting.addModule("/ti/driverlib/AES");
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

/**
 * Write custom configuration values to the imported modules.
 */
AES.profile         = "aes256Enc";
AES.blockCipherMode = "CBC_MODE";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
